{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "47c18a6d",
   "metadata": {},
   "source": [
    "# Neo4j Crud Operations With Python\n",
    "\n",
    "## NoSQL Final Project\n",
    "Walid El Otmani - Graph Database for a Brazilian E-Commerce Store"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3d47abd6",
   "metadata": {},
   "source": [
    "<p>In this notebook we will apply the CRUD operations for a specific customer and save the recommendation system as a function. Python was used to simulate how a real backend program interacts with Neo4j.</p>\n",
    "<p>Instead of manually running queries in Neo4j Browser, the project uses the Neo4j Python Driver inside Jupyter Notebooks to perform create, read, update, and delete actions programmatically.</p>\n",
    "<p>First we start off by importing the packages from neo4j, and creating a connection to the database:</p>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "6db2bbc8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connected to Neo4j!\n"
     ]
    }
   ],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "\n",
    "URI = \"bolt://localhost:7687\"\n",
    "USER = \"neo4j\"\n",
    "PASSWORD = \"password\"  \n",
    "\n",
    "driver = GraphDatabase.driver(URI, auth=(USER, PASSWORD))\n",
    "\n",
    "# Creating a function to run a Cypher query\n",
    "def run_query(query, params=None):\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, params or {})\n",
    "        return [r.data() for r in result]\n",
    "\n",
    "print(\"Connected to Neo4j!\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ac395caf",
   "metadata": {},
   "source": [
    "## Create\n",
    "Now that we connected to the database, let's start with the CRUD Operations. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "e74d5244",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'c': {'customer_state': 'TS',\n",
       "   'customer_id': 'TEST123',\n",
       "   'customer_zip_code_prefix': 12345,\n",
       "   'customer_city': 'TestCity'}}]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create a function to create a customer\n",
    "def create_customer(customer_id, zip_prefix, city, state):\n",
    "    query = \"\"\"\n",
    "    CREATE (c:Customer {\n",
    "        customer_id: $customer_id, \n",
    "        customer_zip_code_prefix: $zip,\n",
    "        customer_city: $city,\n",
    "        customer_state: $state\n",
    "    })\n",
    "    RETURN c\n",
    "    \"\"\"\n",
    "    return run_query(query, {\n",
    "        \"customer_id\": customer_id,\n",
    "        \"zip\": zip_prefix,\n",
    "        \"city\": city,\n",
    "        \"state\": state\n",
    "    })\n",
    "\n",
    "# Test\n",
    "create_customer(\"TEST123\", 12345, \"TestCity\", \"TS\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a2978c22",
   "metadata": {},
   "source": [
    "## Read\n",
    "Now that we created a customer, we can test a Reading operation:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "b42c1f54",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'c': {'customer_state': 'TS',\n",
       "   'customer_id': 'TEST123',\n",
       "   'customer_zip_code_prefix': 12345,\n",
       "   'customer_city': 'TestCity'}}]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create a function to read a customer by customer_id\n",
    "def read_customer(customer_id):\n",
    "    query = \"\"\"\n",
    "    MATCH(c:Customer {customer_id: $customer_id})\n",
    "    RETURN c\n",
    "    \"\"\"\n",
    "    return run_query(query,{\"customer_id\": customer_id})\n",
    "\n",
    "#Testing the read function\n",
    "read_customer(\"TEST123\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "24963a5b",
   "metadata": {},
   "source": [
    "## Update\n",
    "Updating a customer's city"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "fe47fbdd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'c': {'customer_state': 'TS',\n",
       "   'customer_id': 'TEST123',\n",
       "   'customer_city': 'NewTestCity',\n",
       "   'customer_zip_code_prefix': 12345}}]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create a function to update a customer's city \n",
    "def update_customer_city(customer_id, new_city):\n",
    "    query = \"\"\"\n",
    "    MATCH(c:Customer {customer_id: $customer_id})\n",
    "    SET c.customer_city = $new_city\n",
    "    RETURN c\n",
    "    \"\"\"\n",
    "    return run_query(query, {\n",
    "        \"customer_id\": customer_id,\n",
    "        \"new_city\": new_city\n",
    "    })\n",
    "\n",
    "# Testing the update function\n",
    "update_customer_city(\"TEST123\", \"NewTestCity\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "052ae745",
   "metadata": {},
   "source": [
    "## Delete\n",
    "Deleting a customer\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "ca5d0c8e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create a function to delete a customer using customer_id\n",
    "def delete_customer(customer_id):\n",
    "    query = \"\"\"\n",
    "    MATCH(c:Customer {customer_id: $customer_id})\n",
    "    DELETE c\n",
    "    \"\"\"\n",
    "    return run_query(query, {\"customer_id\": customer_id})\n",
    "\n",
    "# Testing the delete Function\n",
    "delete_customer(\"TEST123\")\n",
    "\n",
    "# Verify Deletion\n",
    "read_customer(\"TEST123\")  # Returns an empty list if deletion was successful"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "49b0a132",
   "metadata": {},
   "source": [
    "## Recommendation System\n",
    "Python can also be used to save the recommendation engine in a function, which will be later used as an important part of the backend of the E-commerce store."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "4c836380",
   "metadata": {},
   "outputs": [],
   "source": [
    "def recommend_products(product_id, limit=3):\n",
    "    query = \"\"\"\n",
    "    MATCH (p:Product {product_id: $productId})\n",
    "    WHERE p.in_demo = true\n",
    "    \n",
    "    MATCH (p)<-[:CONTAINS_PRODUCT]-(oi:OrderItem)\n",
    "          <-[:HAS_ITEM]-(o:Order)\n",
    "    MATCH (o)-[:HAS_ITEM]->(otherOi:OrderItem)\n",
    "          -[:CONTAINS_PRODUCT]->(other:Product)\n",
    "    WHERE other.product_id <> p.product_id\n",
    "      AND other.in_demo = true\n",
    "\n",
    "    WITH other, COUNT(DISTINCT o) AS coPurchaseCount\n",
    "    RETURN \n",
    "      other.product_id AS id,\n",
    "      coalesce(other.display_name, other.product_category_name + ' ' + substring(other.product_id, 0, 6)) AS name,\n",
    "      other.product_category_name AS category,\n",
    "      coPurchaseCount\n",
    "    ORDER BY coPurchaseCount DESC\n",
    "    LIMIT $limit\n",
    "    \"\"\"\n",
    "    return run_query(query, {\"productId\": product_id, \"limit\": limit})"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
